eisup_2019_docmng_integration/src/Documents/абс_РасходыНаДобровольноеСтрахованиеНУ/абс_РасходыНаДобровольноеСтрахованиеНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РасходыНаДобровольноеСтрахованиеНУ</name>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоНУ</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРБП</name>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартийНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ЗатратыНалоговыйУчет/ЗатратыНалоговыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНалоговыйУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СписаниеПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартийНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыУчетаПоПБУ18/ВидыУчетаПоПБУ18.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаПоПБУ18</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НУ</name>
    <comment>Налоговый учет</comment>
  </enumValues>
  <enumValues>
    <name>ПР</name>
    <comment>Учет постоянных разниц</comment>
  </enumValues>
  <enumValues>
    <name>ВР</name>
    <comment>Учет временных разниц</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/КодыОперацийЗатраты/КодыОперацийЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийЗатраты</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СписаниеПартийВПроизводствоОперативно</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеПостоянныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВнутренниеУслугиНаПостоянныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>УслугиКонтрагентаНаПостоянныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеОХР_Регламент</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеОПР_Регламент</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеКосвенныхРасходовНУ</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовНаПродажу</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РасходыНаДобровольноеСтрахованиеНУ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроводкиНУ 	= Движения.Налоговый;
	ЗатратыНУ 	= Движения.ЗатратыНалоговыйУчет;
	
	ПроводкиНУ.Очистить();
	ЗатратыНУ.Очистить();
	
	Для Каждого СтрЗатрата Из Затраты Цикл
		
		Если СтрЗатрата.СуммаНУ = 0 И СтрЗатрата.СуммаВР = 0 И СтрЗатрата.СуммаПР = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// По проводкам
		Для Каждого ТекВидУчета Из Перечисления.ВидыУчетаПоПБУ18 Цикл
			
			ТекСуммаПоВидуУчета = 0;
			
			Если ТекВидУчета = Перечисления.ВидыУчетаПоПБУ18.НУ Тогда
				ТекСуммаПоВидуУчета = СтрЗатрата.СуммаНУ;
			ИначеЕсли ТекВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР Тогда
				ТекСуммаПоВидуУчета = СтрЗатрата.СуммаВР;
			ИначеЕсли ТекВидУчета = Перечисления.ВидыУчетаПоПБУ18.ПР Тогда
				ТекСуммаПоВидуУчета = СтрЗатрата.СуммаПР;
			КонецЕсли;
			
			Если ТекСуммаПоВидуУчета = 0 Тогда
				Продолжить;
			КонецЕсли;			
			
			Проводка = ПроводкиНУ.Добавить();
			
			Проводка.Период = Дата;
			Проводка.Организация = Организация;
			
			Проводка.СчетДт = СтрЗатрата.СчетДт;
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 0 Тогда
				Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[0].ВидСубконто] = СтрЗатрата.СубконтоДт1;
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 1 Тогда
				Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[1].ВидСубконто] = СтрЗатрата.СубконтоДт2;
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 2 Тогда
				Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[2].ВидСубконто] = СтрЗатрата.СубконтоДт3;
			КонецЕсли;
					
			Проводка.СчетКт = СтрЗатрата.СчетКт;
			
			Если Проводка.СчетКт.ВидыСубконто.Количество() > 0 Тогда
				Проводка.СубконтоКт[Проводка.СчетКт.ВидыСубконто[0].ВидСубконто] = СтрЗатрата.СтатьяРБП;
			КонецЕсли;
			
			Проводка.Сумма = ТекСуммаПоВидуУчета;
			
			Проводка.ВидУчетаДт = ТекВидУчета;
			Проводка.ВидУчетаКт = ТекВидУчета;
			
		КонецЦикла;
		ПроводкиНУ.Записать();
		
		// По Затратам:
		
		ДвижениеЗатратыНУ = ЗатратыНУ.Добавить();
		
		ДвижениеЗатратыНУ.Организация 		= Организация;
		ДвижениеЗатратыНУ.Период 			= Дата;
		ДвижениеЗатратыНУ.СчетУчета 		= Проводка.СчетДт;
		ДвижениеЗатратыНУ.СтатьяЗатрат 		= Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат];
		ДвижениеЗатратыНУ.Подразделение 	= Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения];
		
		ДвижениеЗатратыНУ.Сумма 			= СтрЗатрата.СуммаНУ;
		ДвижениеЗатратыНУ.ВременнаяРазница 	= СтрЗатрата.СуммаВР;
		ДвижениеЗатратыНУ.ПостояннаяРазница = СтрЗатрата.СуммаПР;
		
		ДвижениеЗатратыНУ.КодОперации		= Перечисления.КодыОперацийЗатраты.УслугиКонтрагентаНаПостоянныеЗатраты;
		
		ЗатратыНУ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
